In [ ]:
import pandas as pd
from scipy import stats

In [29]:
df = pd.read_csv('Datas/pizza_sales.csv')

In [31]:
df.head()

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1,1,hawaiian_m,1,1/1/2015,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2,2,classic_dlx_m,1,1/1/2015,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza
2,3,2,five_cheese_l,1,1/1/2015,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza
3,4,2,ital_supr_l,1,1/1/2015,11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza
4,5,2,mexicana_m,1,1/1/2015,11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza

One Sample T-test

#Is the average total_price of all pizza sales different from $15

In [35]:
'''Workflow-----------
define alpha value(risk limit)
define sample
define column name for sample comparison

testing -> ttest_1samp(column_name,popmean=)
it returns statistics and probablity

print results
compare pvalue and alpha value for correct hypothesis(assumption)
'''

'Workflow-----------\ndefine alpha value(risk limit)\ndefine sample\ndefine column name for sample comparison\n\ntesting -> ttest_1samp(column_name,popmean=)\nit returns statistics and probablity\n\nprint results\ncompare pvalue and alpha value for correct hypothesis(assumption)\n'

In [37]:
alpha = 0.05
sample = 15
total_sales = df['total_price']

In [39]:
t_statistics, pvalue = stats.ttest_1samp(total_sales,popmean=sample)

In [41]:
print(f"Ho: Average total price of all pizza is equal to ${sample}.")
print(f"Ha: Average total price of all pizza is not equal to ${sample}.")
print(f"Statistics:{t_statistics}")
print(f"p-value:{pvalue}")

Ho: Average total price of all pizza is equal to $15.
Ha: Average total price of all pizza is not equal to $15.
Statistics:90.51113970540653
p-value:0.0

In [43]:
if pvalue < alpha:
    print(f"Decision:Failed to accept null Hypothesis.\nConclusion:Accept alternate Hypothesis:Ha: Average total price of all pizza is not equal to $15.")
else:
     print(f"Decision:Failed to reject null Hypothesis.\nConclusion:Accept null Hypothesis:Ha: Average total price of all pizza is not equal to $15.")

Decision:Failed to accept null Hypothesis.
Conclusion:Accept alternate Hypothesis:Ha: Average total price of all pizza is not equal to $15.

In [45]:
#Is average salary of all employees is $5000?

data = pd.read_csv('HR_Dataset Refresh.csv')

In [47]:
data.head()

,Employee_Name,EmpID,MarriedID,MaritalStatusID,GenderID,EmpStatusID,DeptID,PerfScoreID,FromDiversityJobFairID,Salary,...,ManagerName,ManagerID,RecruitmentSource,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,LastPerformanceReview_Date,DaysLateLast30,Absences
0,"Adinolfi, Wilson K",10026,0,0,1,1,5,4,0,62506,...,Michael Albert,22.0,LinkedIn,Exceeds,4.60,5,0,1/17/2019,0,1
1,"Ait Sidi, Karthikeyan",10084,1,1,1,5,3,3,0,104437,...,Simon Roup,4.0,Indeed,Fully Meets,4.96,3,6,2/24/2016,0,17
2,"Akinkuolie, Sarah",10196,1,1,0,5,5,3,0,64955,...,Kissy Sullivan,20.0,LinkedIn,Fully Meets,3.02,3,0,5/15/2012,0,3
3,"Alagbe,Trina",10088,1,1,0,1,5,3,0,64991,...,Elijiah Gray,16.0,Indeed,Fully Meets,4.84,5,0,1/3/2019,0,15
4,"Anderson, Carol",10069,0,2,0,5,5,3,0,50825,...,Webster Butler,39.0,Google Search,Fully Meets,5.00,4,0,2/1/2016,0,2

In [49]:
alp = 0.05
samp = 5000
avg_sal = data['Salary']

In [51]:
T_statistics,p_value = stats.ttest_1samp(avg_sal,popmean=samp)

In [53]:
print(f"Ho: average salary of all employees is ${samp}")
print(f"Ha: average salary of all employees is not ${samp}")

Ho: average salary of all employees is $5000
Ha: average salary of all employees is not $5000

In [55]:
if p_value > alp:
    print(f"Null hypothesis ins true i.e Ho: average salary of all employees is ${samp}")
else:
    print(f"Alternate hypothesis is true i.e Ha: average salary of all employees is not ${samp}")

Alternate hypothesis is true i.e Ha: average salary of all employees is not $5000

#Two smaple t-test

Is the average unit_price of classic pizza vs Chicken Pizzas are equal

In [59]:
#define risk value
alpha = 0.05

In [61]:
#Extract classic pizza price and chicken pizza price.
classic_pizza_price = df[df['pizza_category']=='Classic']['unit_price']
chicken_pizza_price = df[df['pizza_category']=='Chicken']['unit_price']

In [69]:
#two sample t-test calculation
T_stats, p_value = stats.ttest_ind(classic_pizza_price,chicken_pizza_price,equal_var=False)

In [71]:
print('Two sample t-test')
print("Ho: the average unit_price of classic pizza vs Chicken Pizzas are equal")
print("Ha:  the average unit_price of classic pizza vs Chicken Pizzas are not equal")
print(f"Classic pizza price :{classic_pizza_price.mean()}") #testing
print(f"Chicken pizza price :{chicken_pizza_price.mean()}") #testing
print(f"Statistics:{t_statistics:.2f}")
print(f"P-value:{p_value}")

Two sample t-test
Ho: the average unit_price of classic pizza vs Chicken Pizzas are equal
Ha:  the average unit_price of classic pizza vs Chicken Pizzas are not equal
Classic pizza price :14.797489539748952
Chicken pizza price :17.70940822931114
Statistics:90.51
P-value:0.0

In [75]:
if p_value < alpha:
    print(f"Null hypothesis is incorrect\ni.e Ha:  the average unit_price of classic pizza vs Chicken Pizzas are not equal ")
else:
    print("Ho:  the average unit_price of classic pizza vs Chicken Pizzas are equal")

Null hypothesis is incorrect
i.e Ha:  the average unit_price of classic pizza vs Chicken Pizzas are not equal

#Anova Testing

Is the avg_total_price of all four pizza category are equal

In [83]:
categories = df['pizza_category'].unique()
categories

array(['Classic', 'Veggie', 'Supreme', 'Chicken'], dtype=object)

In [85]:
grouped_list = []
for category in categories:
    category_price = df[df['pizza_category']==category]['total_price']
    grouped_list.append(category_price)

In [89]:
grouped_list

[0        13.25
 1        16.00
 11       12.00
 14       12.00
 16       20.50
          ...
 48600    15.25
 48604    12.50
 48605    12.00
 48607    12.00
 48617    12.00
 Name: total_price, Length: 14579, dtype: float64,
 2        18.50
 4        16.00
 15       12.00
 19       12.00
 21       20.75
          ...
 48598    20.25
 48603    14.75
 48606    16.50
 48616    17.95
 48618    20.25
 Name: total_price, Length: 11449, dtype: float64,
 3        20.75
 6        16.50
 7        20.75
 8        16.50
 9        16.50
          ...
 48601    41.50
 48602    20.25
 48610    20.75
 48612    16.50
 48613    12.50
 Name: total_price, Length: 11777, dtype: float64,
 5        20.75
 10       12.75
 24       20.75
 25       20.75
 26       20.75
          ...
 48609    12.75
 48611    16.75
 48614    20.75
 48615    16.75
 48619    12.75
 Name: total_price, Length: 10815, dtype: float64]

In [93]:
#unpack list in function for calculation
t_statistics, p_value = stats.f_oneway(*grouped_list)

In [101]:
mean_price = df.groupby('pizza_category')['total_price'].mean()
mean_price

pizza_category
Chicken    18.115534
Classic    15.093840
Supreme    17.678271
Veggie     16.917674
Name: total_price, dtype: float64

In [109]:
formtted_price = mean_price.map("${:,.2f}".format).to_markdown(numalign ='Left' ,stralign = 'left')
formtted_price

'| pizza_category   | total_price   |\n|:-----------------|:--------------|\n| Chicken          | $18.12        |\n| Classic          | $15.09        |\n| Supreme          | $17.68        |\n| Veggie           | $16.92        |'

In [103]:
print('Anova Test')
print("Ho:The average total_price of all 4 pizza category are equal.")
print("Ha:The average total_price of all 4 pizza category are not equal.")

Anova Test

In [107]:
if p_value < alpha:
    print('failed null hypothesis')
else:
    print('pass Alternate Hypothesis')

failed null hypothesis